{"id":82,"date":"2023-10-28T21:21:01","date_gmt":"2023-10-28T19:21:01","guid":{"rendered":"http:\/\/imagine.local\/?page_id=82"},"modified":"2025-10-15T22:11:19","modified_gmt":"2025-10-15T20:11:19","slug":"imagine-project-description","status":"publish","type":"page","link":"http:\/\/imagine.local\/imagine-project-description\/","title":{"rendered":"IMAGINE research group &#8211; Description"},"content":{"rendered":"\n<p><mark style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-black-color\">IMAGINE is a research group of the University of Oviedo whose main research areas focus on the mathematical modeling of imprecision within the framework of Imprecise Probability Theory, the aggregation of different types of data through Aggregation Operators, and the comparison of random quantities using Stochastic Orders.<\/mark><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Description of the research<\/strong><\/h2>\n\n\n\n<p><mark style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-black-color\">The mathematical modeling of uncertainty and preferences often involves several inputs that must be aggregated into a global model. These inputs may arise, for instance, from the opinions of multiple experts, the observation of a set of variables, or from various information sources providing data. The output may also take different forms: for example, in a voting context we may obtain several orderings among the options, whereas in a random experiment we may have multiple probability distributions. The aggregation procedure should therefore take into account the nature of the inputs and the type of output.<\/mark><\/p>\n\n\n\n<p><mark style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-black-color\">This problem has given rise to two major areas within Mathematics: <em>social choice theory<\/em> and <em>probabilistic aggregation<\/em>. The former seeks to determine the ordering among a set of alternatives that best reflects the preferences of a group of voters, whereas the latter aims to identify the probabilistic model that best summarizes a collection of belief models. These two fields share several common elements: in both cases, the objective is to aggregate the opinions of multiple individuals, either in the form of beliefs (probabilities) or preferences (typically expressed as utilities or rankings). On the other hand, they also display distinct characteristics: for example, in probabilistic aggregation it may be reasonable to assume the existence of a single global model that adequately represents the uncertainty of the experiment, while in social choice it may be desirable for the global model to reflect, at least partially, the preferences of all voters.<\/mark><\/p>\n\n\n\n<p><mark style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-black-color\">A factor that arises in both contexts and may complicate the aggregation process is <em>indecision<\/em>, particularly in cases involving imprecise or ambiguous information. For instance, one may encounter situations with missing data, transmission errors, or cases where the available information does not justify eliciting a complete ordering or a precise probability measure. A possible solution in such situations consists of proceeding as far as possible in the modeling process, by considering, for example, <em>partial orderings<\/em> or <em>sets of probability measures<\/em>. However, determining the global model in such cases becomes more complex, as the procedure must adequately distinguish between <em>indecision<\/em> and <em>indifference<\/em>.<\/mark><\/p>\n\n\n\n<p><mark style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-black-color\">The research areas we focus on, mainly ordering of random variables and imprecise probabilities, have attracted significant attention from the scientific community in recent years. Some of the reasons for this growing interest include the profound impact that ambiguity, imprecision, and uncertainty have on the technical development of information technologies. The main areas of application include decision theory under uncertainty, preference modeling with risk aversion in economics and finance (e.g., in portfolio optimization), machine learning, or multi-criteria decision-making, among many others.<\/mark><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Collaborations<\/strong><\/h2>\n\n\n\n<p><mark style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-black-color\">Besides the usual interactions among the members of our group, we also maintain several international collaborations. Among our collaborators are <a href=\"https:\/\/users.ugent.be\/~gdcooma\/\">Gert de Cooman<\/a> and <a href=\"https:\/\/ai.ugent.be\/people\/BernardDeBaets.en.html\">Bernard De Baets<\/a> (Ghent University, Belgium), <a href=\"https:\/\/people.idsia.ch\/~zaffalon\/\">Marco Zaffalon<\/a> (IDSIA, Switzerland), <a href=\"https:\/\/deams.units.it\/en\/node\/1422\">Paolo Vicig<\/a> and <a href=\"https:\/\/sites.units.it\/renatop\/\">Renato Pelessoni<\/a> (University of Trieste, Italy), <a href=\"https:\/\/arthurvancamp.github.io\/\">Arthur Van Camp<\/a> (Eindhoven University of Technology, the Netherlands), <a href=\"https:\/\/www.hds.utc.fr\/~sdesterc\/dokuwiki\/\">Sébastien Destercke<\/a> (University of Technology of Compiègne, France), and <a href=\"https:\/\/www.gagolewski.com\/index.html\">Marek Gagolewski<\/a> (Warsaw University of Technology, Poland), among others.<\/mark><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Activities<\/strong><\/h2>\n\n\n\n<p><mark style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-black-color\">Apart from our regular group meetings, we usually attend conferences such as ISIPTA, IPMU, EUSFLAT, or ECSQARU, where we organise special sessions and serve on the program committee. We have also organized scientific events such as the ISIPTA 2023 conference, the SIPTA Summer School 2018, and the WMPSIIP Workshop 2018, as well as, more recently, the Spanish Mathematical Olympiad in 2025.<\/mark><\/p>\n","protected":false},"excerpt":{"rendered":"<p>IMAGINE is a research group of the University of Oviedo whose main research areas focus on the mathematical modeling of imprecision within the framework of Imprecise Probability Theory, the aggregation of different types of data through Aggregation Operators, and the comparison of random quantities using Stochastic Orders. Description of the research The mathematical modeling of&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-templates\/full-width.php","meta":{"footnotes":""},"class_list":["post-82","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"http:\/\/imagine.local\/wp-json\/wp\/v2\/pages\/82","targetHints":{"allow":["GET"]}}],"collection":[{"href":"http:\/\/imagine.local\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/imagine.local\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/imagine.local\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/imagine.local\/wp-json\/wp\/v2\/comments?post=82"}],"version-history":[{"count":8,"href":"http:\/\/imagine.local\/wp-json\/wp\/v2\/pages\/82\/revisions"}],"predecessor-version":[{"id":841,"href":"http:\/\/imagine.local\/wp-json\/wp\/v2\/pages\/82\/revisions\/841"}],"wp:attachment":[{"href":"http:\/\/imagine.local\/wp-json\/wp\/v2\/media?parent=82"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}